app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def current_user
    if logged_in?
       @current_user ||= User.find(session[:id])